settings.el

(setq my-emacsd (file-name-as-directory "~/.emacs.d"))
(add-to-list 'load-path "/usr/share/emacs24/site-lisp/mu4e")
(setq inhibit-startup-message t)
(column-number-mode 1)
(setq sentence-end-double-space nil)
(setq enable-recursive-minibuffers)
(setq lexical-binding t)
(menu-bar-mode -1)
(tool-bar-mode -1)
(scroll-bar-mode -1)
(fset 'yes-or-no-p 'y-or-n-p)
(global-visual-line-mode)
(add-hook 'before-save-hook 'delete-trailing-whitespace)
(setq gc-cons-threshold (* 20 1024 1024))
(require 'cl)

;; No tabs
(setq-default indent-tabs-mode nil)

(setq scroll-margin 1
      scroll-conservatively 10000
      scroll-up-aggressively 0.01
      scroll-down-aggressively 0.01
      auto-window-vscroll nil)

(setq custom-file "~/.emacs.d/custom.el")
(load custom-file)

(set-register ?i '(file . "~/.emacs.d/settings.org"))
(set-register ?s '(file . "~/Dropbox/Notes & HW/schedule.org"))

;;; Sets 'p' key to act as a register for a macro to produce category tags for org captures
(set-register ?p [registerv
                  [tab tab 58 80 82 79 company-dummy-event 80 69 82 84 73 69 83 58 10 34 67 65 backspace backspace backspace 58 67 65 84 69 71 79 82 89 58 return tab 58 69 78 68 company-dummy-event 58 16 5 32]
                  #[(k)
                    "\301\302\303\304!\"!\207"
                    [k princ format "a keyboard macro:\n   %s" format-kbd-macro]
                    5]
                  kmacro-execute-from-register
                  #[(k)
                    "\301!c\207"
                    [k format-kbd-macro]
                    2]])

(require 'server)
(unless (server-running-p)
  (server-start))

;; Help, source commands
(define-key 'help-command (kbd "C-l") 'find-library)
(define-key 'help-command (kbd "C-f") 'find-function)
(define-key 'help-command (kbd "C-k") 'find-function-on-key)
(define-key 'help-command (kbd "C-v") 'find-variable)

(global-subword-mode 1)

(require 'saveplace)
(setq-default save-place t)
(setq save-place-file (expand-file-name ".places" user-emacs-directory))

(recentf-mode)
(setq
 recentf-max-menu-items 30
 recentf-max-saved-items 5000
 )

;; Backup Management
(setq backup-directory-alist '((".*" . "~/.emacs.d/tmp/"))
      backup-by-copying t
      delete-old-versions t
      kept-new-versions 6
      kept-old-versions 2
      version-control 1)

;; Autosave Management
(defvar my-auto-save-folder "~/.emacs.d/tmp/")
(add-to-list 'auto-save-file-name-transforms
             (list "\\(.+/\\)*\\(.*?\\)" (expand-file-name "\\2" my-auto-save-folder))
             t)

(load "~/.private.el")

;; Renaming Buffer/File Snippet
(defun rename-current-buffer-file ()
  "Renames current buffer and file it is visiting."
  (interactive)
  (let ((name (buffer-name))
        (filename (buffer-file-name)))
    (if (not (and filename (file-exists-p filename)))
        (error "Buffer '%s' is not visiting a file!" name)
      (let ((new-name (read-file-name "New name: " filename)))
        (if (get-buffer new-name)
            (error "A buffer named '%s' already exists!" new-name)
          (rename-file filename new-name 1)
          (rename-buffer new-name)
          (set-visited-file-name new-name)
          (set-buffer-modified-p nil)
          (message "File '%s' successfully renamed to '%s'"
                   name (file-name-nondirectory new-name)))))))

(global-set-key (kbd "C-x C-r") 'rename-current-buffer-file)

(defun smarter-move-beginning-of-line (arg)
  "Move point back to indentation of beginning of line.

Move point to the first non-whitespace character on this line.
If point is already there, move to the beginning of the line.
Effectively toggle between the first non-whitespace character and
the beginning of the line.

If ARG is not nil or 1, move forward ARG - 1 lines first.  If
point reaches the beginning or end of the buffer, stop there."
  (interactive "^p")
  (setq arg (or arg 1))

  ;; Move lines first
  (when (/= arg 1)
    (let ((line-move-visual nil))
      (forward-line (1- arg))))

  (let ((orig-point (point)))
    (back-to-indentation)
    (when (= orig-point (point))
      (move-beginning-of-line 1))))

(global-set-key [remap move-beginning-of-line]
                'smarter-move-beginning-of-line)

(defun python-docstring ()
  (interactive)
  (dotimes (x 6)
    (insert "\'"))
  (backward-char 3))
;; (add-hook 'python-mode-hook '(global-set-key (kbd "C-x \'") 'python-docstring))
(global-set-key (kbd "C-x \'") 'python-docstring)

(defun sudo-edit (&optional arg)
  "Edit currently visited file as root.

With a prefix ARG prompt for a file to visit.
Will also prompt for a file to visit if current
buffer is not visiting a file."
  (interactive "P")
  (if (or arg (not buffer-file-name))
      (find-file (concat "/sudo:root@localhost:"
                         (ido-read-file-name "Find file(as root): ")))
    (find-alternate-file (concat "/sudo:root@localhost:" buffer-file-name))))

(set-fringe-mode '(nil . 0))

;; Enabled commands
(put 'set-goal-column 'disabled nil)
(put 'downcase-region 'disabled nil)
(put 'upcase-region 'disabled nil)

(require 'uniquify)

(global-auto-revert-mode 1)
(setq global-auto-revert-non-file-buffers t)
(setq auto-revert-verbose nil)

(require 'frame)
(add-to-list 'default-frame-alist '(cursor-color . "#c6c6c6" ))

(blink-cursor-mode 1)
(setq blink-cursor-blinks 5)

(electric-indent-mode -1)

(when window-system
  (set-frame-size (selected-frame) 160 80)
  (set-face-attribute 'default nil :height 130))

;; ELPA/Marmalade
(require 'package)

(add-to-list 'package-archives
             '("melpa" . "http://melpa.milkbox.net/packages/") t)
(add-to-list 'package-archives
             '("elpy" . "http://jorgenschaefer.github.io/packages/"))
(package-initialize)

(unless (package-installed-p 'use-package)
  (package-install 'use-package))

(require 'use-package)
(setq use-package-always-ensure t)

(use-package hydra
   :ensure t
   :config
   (defhydra hydra-zoom (global-map "<f2>")
     "zoom"
     ("g" text-scale-increase "in")
     ("l" text-scale-decrease "out"))

   (defhydra hydra-text (global-map "C-c t")
     "text"
     ("a" align-regexp "align")
     ("f" toggle-text-mode-auto-fill "auto-fill")
     ("s" sort-lines "sort")))
