settings.el

;;  (require 'moe-theme)
;;  (moe-theme-set-color 'black)
;;  (load-theme 'moe-dark)
(use-package monokai-theme
  :config (load-theme 'monokai))

(use-package smart-mode-line
    :ensure t
    :init (setq sml/theme 'dark)
    :config
    (add-to-list 'sml/replacer-regexp-list '("^~/Dropbox/Notes & HW/" ":N&H:"))
    (add-to-list 'sml/replacer-regexp-list '("^~/Dropbox/Notes & HW/System/" ":2110:"))
    (sml/setup))

(use-package yasnippet
  :ensure t
  :init (setq yas-snippet-dirs '("~/.emacs.d/yasnippet-snippets"))
  :config
  (define-key yas-minor-mode-map (kbd "M-/") 'yas-expand)
  (define-key yas-minor-mode-map (kbd "TAB") nil)
  (yas/initialize)
  (yas-global-mode 1)
  )

(use-package company
  :ensure t
  :config
  (global-company-mode 1)

  (setq company-backends (remove 'company-eclim company-backends)))

(use-package flx-ido
  :ensure t
  :config (flx-ido-mode 1))

(use-package ido-vertical-mode
  :ensure t
  :init (setq ido-vertical-define-keys 'C-n-and-C-p-only)
  :config (ido-vertical-mode))

(use-package ido
  :ensure smex
  :init
  (setq ido-enable-flex-matching t
        ido-enable-prefix nil
        ido-case-fold nil
        ido-create-new-buffer 'always
        ido-max-prospects 10
        ido-use-faces nil)
  :config
  (global-set-key (kbd "M-X") 'smex-major-mode-commands))

(use-package helm
    :ensure t
    :config
    (helm-mode 1)
    (setq helm-quick-update t
          helm-idle-delay 0.01
          helm-input-idle-delay 0.01)
    (add-to-list 'helm-completing-read-handlers-alist '(find-file . ido))

    (global-set-key (kbd "C-x C-m") 'helm-command-prefix)
    (define-key helm-map (kbd "C-i") 'helm-execute-persistent-action)
    (define-key helm-map (kbd "<tab>") 'helm-execute-persistent-action)
    (define-key helm-map (kbd "C-z") 'helm-select-action)
    (define-key helm-map (kbd "C-M-i") 'helm-select-action)
    (global-set-key (kbd "C-x b") 'helm-mini)

    (global-set-key (kbd "C-h a") 'helm-apropos)

    (global-set-key (kbd "M-y") 'helm-show-kill-ring)
    (global-set-key (kbd "<menu>") 'helm-M-x)
    (global-set-key (kbd "M-x") 'helm-M-x)
    (global-set-key (kbd "C-x i") 'helm-semantic-or-imenu)

;;; Fancy Dislay settings
    (setq helm-display-header-line nil)
    (set-face-attribute 'helm-source-header nil :height 1.0)
    (helm-autoresize-mode 1)
    (setq helm-autoresize-max-height 30)
    (setq helm-autoresize-min-height 30)
    (setq helm-split-window-in-side-p t))

(use-package helm-descbinds
    :ensure t
    :config
    (helm-descbinds-mode))

(use-package helm-swoop
    :ensure t
    :config
    (global-set-key (kbd "C-x j") 'helm-swoop)
    (global-set-key (kbd "M-i") 'helm-multi-swoop)

    ;; When doing isearch, hand the word over to helm-swoop
    (define-key isearch-mode-map (kbd "M-i") 'helm-swoop-from-isearch)
    ;; From helm-swoop to helm-multi-swoop-all
    (define-key helm-swoop-map (kbd "M-i") 'helm-multi-swoop-all-from-helm-swoop)
    (setq helm-swoop-split-direction 'split-window-vertically))

;; (setq
;;  helm-gtags-ignore-case t
;;  helm-gtags-auto-update t
;;  helm-gtags-use-input-at-cursor t
;;  helm-gtags-pulse-at-cursor t
;;  helm-gtags-prefix-key "\C-cg"
;;  helm-gtags-suggested-key-mapping t
;;  )

;; (require 'helm-gtags)
;; ;; Enable helm-gtags-mode
;; (add-hook 'dired-mode-hook 'helm-gtags-mode)
;; (add-hook 'eshell-mode-hook 'helm-gtags-mode)
;; (add-hook 'c-mode-hook 'helm-gtags-mode)
;; (add-hook 'c++-mode-hook 'helm-gtags-mode)
;; (add-hook 'asm-mode-hook 'helm-gtags-mode)

;; (define-key helm-gtags-mode-map (kbd "C-c g a") 'helm-gtags-tags-in-this-function)
;; (define-key helm-gtags-mode-map (kbd "C-j") 'helm-gtags-select)
;; (define-key helm-gtags-mode-map (kbd "M-.") 'helm-gtags-dwim)
;; (define-key helm-gtags-mode-map (kbd "M-,") 'helm-gtags-pop-stack)
;; (define-key helm-gtags-mode-map (kbd "C-c <") 'helm-gtags-previous-history)
;; (define-key helm-gtags-mode-map (kbd "C-c >") 'helm-gtags-next-history)

(use-package projectile
    :ensure t
    :config
(projectile-global-mode)
(global-set-key (kbd "C-c h") 'helm-projectile))

;; Keybindings
(global-set-key "\C-x\C-b" 'electric-buffer-list)
(global-set-key "\M-g" 'goto-line)
(global-set-key (kbd "M-<f4>") 'save-buffers-kill-terminal) ;; Old binding for C-x C-c
(global-set-key (kbd "C-x C-c") 'delete-frame)
(global-set-key (kbd "C-s") 'isearch-forward-regexp)
(global-set-key (kbd "C-r") 'isearch-backward-regexp)
(global-set-key (kbd "RET") 'newline-and-indent)

(global-set-key (kbd "<f7>") 'eshell)

(use-package helm-flycheck)

(use-package flycheck
    :ensure t
    :config
    (custom-set-variables
     '(flycheck-display-errors-function #'flycheck-pos-tip-error-messages))
    (define-key flycheck-mode-map (kbd "C-c ! h") 'helm-flycheck)
    (global-flycheck-mode)
    (add-hook 'emacs-lisp-mode-hook (lambda () (flycheck-mode -1)))
    (add-hook 'ess-mode-hook (lambda () (flycheck-mode -1))))

(use-package magit
    :ensure t
    :bind ("C-c C-c g" . magit-status)
    :config
    (setq magit-last-seen-setup-instructions "1.4.0"))

(use-package eyebrowse
  :ensure t
  :init
  (setq eyebrowse-keymap-prefix (kbd "C-z"))
  :config
  (eyebrowse-mode))

(use-package smartparens
  :ensure t
  :config
  (require 'smartparens-config)
  (smartparens-global-mode t)
  (show-smartparens-global-mode t)
  (sp-use-paredit-bindings)
  (smartparens-global-strict-mode)
  (sp-with-modes '(c-mode c++-mode java-mode)
    (sp-local-pair "{" nil :post-handlers '(("||\n[i]" "RET")))
    (sp-local-pair "/*" "*/" :post-handlers '((" | " "SPC")
                                              ("* ||\n[i]" "RET")))))

(use-package ggtags
    :ensure t
    :config
    (add-hook 'c-mode-common-hook
              (lambda ()
                (when (derived-mode-p 'c-mode 'java-mode 'asm-mode)
                  (ggtags-mode 1))))
    (define-key ggtags-mode-map (kbd "M-,") 'pop-tag-mark))

;; GDB Many Windows
(setq
 ;; use gdb-many-windows by default
 gdb-many-windows t

 ;; Non-nil means display source file containing the main routine at startup
 gdb-show-main t)
