settings.el

(use-package jedi
  :ensure t
  :config
  (add-hook 'python-mode-hook 'jedi:setup)
  (setq jedi:complete-on-dot 't)
  (setq jedi:tooltip-method nil)
  (setq jedi:use-shortcuts 't)
  (setq jedi:environment-virtualenv
        (list "virtualenv3" "--system-site-packages")))

(defun use-paredit-mode ()
  (enable-paredit-mode)
  (smartparens-mode -1))

(use-package paredit
    :ensure t
    :config
    (add-hook 'slime-mode-hook 'use-paredit-mode)
    (add-hook 'slime-repl-mode-hook 'use-paredit-mode)
    (add-hook 'slime-hook 'use-paredit-mode)
    (add-hook 'scheme-mode-hook 'use-paredit-mode)
    (add-hook 'emacs-lisp-mode-hook 'use-paredit-mode)
    (add-hook 'geiser-mode-hook 'use-paredit-mode)
    (add-hook 'geiser-repl-mode-hook 'use-paredit-mode)
    (add-hook 'clojure-mode-hook 'enable-paredit-mode)
    (add-hook 'cider-repl-mode-hook 'enable-paredit-mode))

(defun paredit-commands-sheet ()
  (interactive)
  (elscreen-create)
  (elscreen-screen-nickname "Paredit Cheat Sheet")
  (find-file "~/PareditCheatsheet.png"))

(use-package aggressive-indent
    :ensure t
    :config
    (add-hook 'emacs-lisp-mode-hook #'aggressive-indent-mode)
    (add-hook 'lisp-mode-hook #'aggressive-indent-mode)
    (add-hook 'clojure-mode-hook #'aggressive-indent-mode))

(add-hook 'emacs-lisp-mode-hook 'turn-on-eldoc-mode)
(add-hook 'lisp-interaction-mode-hook 'turn-on-eldoc-mode)
(add-hook 'ielm-mode-hook 'turn-on-eldoc-mode)
(add-hook 'cider-mode-hook 'cider-turn-on-eldoc-mode)

(use-package pretty-symbols
  :ensure t
  :init
  (add-hook 'emacs-lisp-mode 'lisp-prettify)
  (add-hook 'slime-mode-hook 'lisp-prettify)
  (add-hook 'slime-repl-mode-hook 'lisp-prettify)
  (add-hook 'clojure-mode-hook 'lisp-prettify)
  (add-hook 'cider-mode-hook 'lisp-prettify))

(defun lisp-prettify ()
  (setf pretty-symbol-categories '(lambda))
  (pretty-symbols-mode))

(put 'unless-let 'clojure-indent-function 2)
(put 'facts 'clojure-indent-function 1)

(use-package cider
    :ensure t
    :config
    (add-hook 'cider-repl-mode-hook 'rainbow-delimiters-mode)
    (setq cider-repl-use-pretty-printing t))

(defun clj-ref-setup ()
  (clj-refactor-mode 1)
  (cljr-add-keybindings-with-prefix "C-c C-c"))

(use-package clj-refactor
    :ensure t
    :config
    (add-hook 'clojure-mode-hook 'clj-ref-setup))

(put 'fresh 'scheme-indent-function 1)
(put 'run 'scheme-indent-function 2)
(put 'run* 'scheme-indent-function 1)

(add-hook 'geiser-repl-mode-hook 'rainbow-delimiters-mode)
(add-hook 'geiser-mode-hook 'rainbow-delimiters-mode)

(use-package paxedit
    :ensure t
    :init
    (add-hook 'lisp-mode-hook 'paxedit-mode)
    (add-hook 'emacs-lisp-mode-hook 'paxedit-mode)
    (add-hook 'cider-repl-mode-hook 'paxedit-mode)
    (add-hook 'geiser-mode-hook 'paxedit-mode)
    (add-hook 'geiser-repl-mode-hook 'paxedit-mode)
    (add-hook 'clojure-mode-hook 'paxedit-mode)
    :config
    (define-key paxedit-mode-map (kbd "M-<right>") 'paxedit-transpose-forward)
    (define-key paxedit-mode-map (kbd "M-<left>") 'paxedit-transpose-backward)
    (define-key paxedit-mode-map (kbd "M-<up>") 'paxedit-backward-up)
    (define-key paxedit-mode-map (kbd "M-<down>") 'paxedit-backward-end)
    (define-key paxedit-mode-map (kbd "M-b") 'paxedit-previous-symbol)
    (define-key paxedit-mode-map (kbd "M-f") 'paxedit-next-symbol)
    (define-key paxedit-mode-map (kbd "C-%") 'paxedit-copy)
    (define-key paxedit-mode-map (kbd "C-S-k") 'paxedit-kill)
    (define-key paxedit-mode-map (kbd "C-*") 'paxedit-delete)
    (define-key paxedit-mode-map (kbd "C-^") 'paxedit-sexp-raise)
    (define-key paxedit-mode-map (kbd "M-u") 'paxedit-symbol-change-case)
    (define-key paxedit-mode-map (kbd "C-@") 'paxedit-symbol-copy)
    (define-key paxedit-mode-map (kbd "C-#") 'paxedit-symbol-kill))

;; (use-package lispy
;;   :ensure t
;;   :init
;;   (add-hook 'emacs-lisp-mode-hook 'lispy-mode)
;;   (add-hook 'clojure-mode-hook 'lispy-mode))

(defun my-irony-mode-hook ()
  (define-key irony-mode-map [remap completion-at-point]
    'irony-completion-at-point-async)
  (define-key irony-mode-map [remap complete-symbol]
    'irony-completion-at-point-async))

(use-package irony
  :ensure t
  :init
  (add-hook 'c++-mode-hook 'irony-mode)
  (add-hook 'c-mode-hook 'irony-mode)
  (add-hook 'objc-mode-hook 'irony-mode)

  (add-hook 'irony-mode-hook 'my-irony-mode-hook)
  (add-hook 'irony-mode-hook 'irony-cdb-autosetup-compile-options)
  (add-to-list 'company-backends 'company-irony))

(use-package cc-mode
  :ensure t
  :config (setq c-default-style "linux")
  )

(add-hook 'c++-mode-hook (lambda () (setq flycheck-clang-language-standard "c++11")))
(add-hook 'c++-mode-hook (lambda () (setq flycheck-gcc-language-standard "c++11")))
(define-key c++-mode-map (kbd "<f5>") #'cmake-ide-compile)

(use-package company-c-headers
  :ensure t
  :config
  (add-to-list 'company-c-headers-path-system "/usr/include/c++/4.8/")
  (add-to-list 'company-backends 'company-c-headers))

(use-package rtags
  :ensure t
  :config
  (rtags-enable-standard-keybindings)
  )

(use-package cmake-ide
  :ensure t
  :init (require 'rtags)
  :config (cmake-ide-setup))

(use-package tex
  :ensure nil
  :init
  :config
  (setq TeX-auto-save t
        TeX-parse-self t
        TeX-save-query nil)
  (TeX-global-PDF-mode t)
  (setq-default TeX-engine 'xetex)
  ;; (add-to-list 'TeX-output-view-style
  ;;              '("^pdf$" "." "mupdf %o %(outpage)"))
  )

(add-hook 'latex-mode-hook 'flyspell-mode)

;; Javadoc Lookup
(global-set-key (kbd "C-h j") 'javadoc-lookup)

(require 'cedet)
(require 'semantic)
;; (load "semantic/loaddefs.el")
(setq semantic-default-submodes '(global-semantic-idle-scheduler-mode
                                  global-semanticdb-minor-mode
                                  global-semantic-idle-summary-mode
                                  global-semantic-mru-bookmark-mode))
(semantic-mode 1)
;; (require 'malabar-mode)
;; (add-to-list 'auto-mode-alist '("\\.java\\'" . malabar-mode))

;; (require 'eclim)
;; (require 'eclimd)
;; (global-eclim-mode)
;; (require 'company-emacs-eclim)
;; (company-emacs-eclim-setup)
;; (defun my-eclim-keys ()
;;   (local-set-key (kbd "C-c C-e p r") 'eclim-run-class))
;; (add-hook 'java-mode-hook 'my-eclim-keys)

(use-package ess-site
  :ensure nil)
(use-package ess-utils
  :ensure nil)
