settings.org
** Mail - Not in Use
#    Currently using mu4e for mail-purposes
# #+BEGIN_SRC emacs-lisp
#   (require 'mu4e)

#   (setq mu4e-maildir "~/Maildir"
#         mu4e-drafts-folder "/[GMAIL].Drafts"
#         mu4e-sent-folder   "/[GMAIL].Sent Mail"
#         mu4e-trash-folder  "/[GMAIL].Trash")

#   (setq mu4e-sent-messages-behavior 'delete)

#   ;; Use Imagemagick, when possible
#   (when (fboundp 'imagemagick-register-types)
#     (imagemagick-register-types))
# #+END_SRC
# **** Mu4e Shortcuts
# #+BEGIN_SRC emacs-lisp
#   (setq mu4e-maildir-shortcuts
#         '( ("/INBOX"             . ?i)
#            ("/[Gmail].Important" . ?m)
#            ("/[Gmail].Starred"   . ?r)
#            ("/[Gmail].Sent Mail" . ?s)
#            ("/[Gmail].Trash"     . ?t)
#            ("/[Gmail].All Mail"  . ?a)))

#   ;; Allow for updating mail w/ "U" in main view
#   (setq mu4e-get-mail-command "offlineimap")
# #+END_SRC
# **** Personal Info
# #+BEGIN_SRC emacs-lisp
#   (setq user-mail-address "sam.sam.42@gmail.com"
#         user-full-name  "Sam Blumenthal")

# #+END_SRC
# **** Sending Mail
# #+BEGIN_SRC emacs-lisp
#   (require 'smtpmail)
#   (setq message-send-mail-function 'smtpmail-send-it
#         smtpmail-stream-type 'starttls
#         smtpmail-default-smtp-server "smtp.gmail.com"
#         smtpmail-smtp-server "smtp.gmail.com"
#         smtpmail-smtp-service 587)

#   ;; Don't keep message buffers around
#   (setq message-kill-buffer-on-exit t)

# #+END_SRC
# **** Some of my own various Mu4e hacks.
# #+BEGIN_SRC emacs-lisp
#   ;; Use unicode characters
#   (setq mu4e-use-fancy-chars t)
#   ;; Set mu4e as default email client
#   (setq mail-user-agent 'mu4e-user-agent)
#   ;; Skip Duplicates (toggle w/ V)
#   (setq mu4e-headers-skip-duplicates t)
#   ;; Update mail every 5 minutes
#   ;; (run-at-time "2:40pm" 300 'mu4e-update-mail-and-index)
#   ;; View emails in browser w/ aV
#   (add-to-list 'mu4e-view-actions
#                '("ViewInBrowser" . mu4e-action-view-in-browser) t)
#   ;; (Maybe) show images
#   (setq mu4e-show-images t)
#   ;; Spell check, while composing emails
#   (add-hook 'mu4e-compose-mode-hook 'flyspell-mode)
#   ;; Show related results in searches (toggle w/ W
#   (setq mu4e-headers-include-related t)

#   ;; Attempts to get tracking.el working with mu4e
#   (tracking-add-buffer (get-buffer "*mu4e-headers*"))

#   ;; Hopefully get Dired-attachments working w/ mu4e
#   (require 'gnus-dired)
#   ;; make the `gnus-dired-mail-buffers' function also work on
#   ;; message-mode derived modes, such as mu4e-compose-mode

#   (defun gnus-dired-mail-buffers ()
#     "Return a list of active message buffers."
#     (let (buffers)
#       (save-current-buffer
#         (dolist (buffer (buffer-list t))
#           (set-buffer buffer)
#           (when (and (derived-mode-p 'message-mode)
#                      (null message-sent-message-via))
#             (push (buffer-name buffer) buffers))))
#       (nreverse buffers)))

#   (setq gnus-dired-mail-mode 'mu4e-user-agent)
#   (add-hook 'dired-mode-hook 'turn-on-gnus-dired-mode)

#   ;; Set up mail in it's own elscreen
#   (defun begin-mail ()
#     (interactive)
#     (elscreen-create)
#     (mu4e))
# #+END_SRC
** IRC - Not in use
#     Currently using Circe for emacs-based IRC
# #+BEGIN_SRC emacs-lisp
#   (require 'circe)
#   (setq circe-network-options
#         `(("Freenode"
#            :nick "kyo91"
#            :channels ("#emacs", "#clojure")
#            :nickserv-password, irc-password)))
#   (eval-after-load 'circe '(require 'circe-chanop))
#   (eval-after-load 'circe
#     '(defun lui-irc-propertize (&rest args)))

#   (add-to-list 'circe-networks
#                '("Rizon"
#                  :host "irc.rizon.net"
#                  :port (6667 . 6697)
#                  :nickserv-mask "^NickServ!NickServ@services\\.$"
#                  :nickserv-identify-challenge "\C-b/msg\\s-NickServ\\s-identify\\s-<password>\C-b"
#                  :nickserv-identify-command "PRIVMSG NickServ :IDENTIFY {nick} {password}"
#                  :nickserv-identify-confirmation "^You are now identified for .*\\.$"
#                  :nickserv-ghost-command "PRIVMSG NickServ :GHOST {nick} {password}"
#                  :nickserv-ghost-confirmation "has been ghosted\\.$\\|is not online\\.$"
#                  ))

#   (add-to-list 'circe-network-options
#                `("Rizon"
#                  :nick "kyo91"
#                  :channels ("#r/a/dio" "#/g/lisp")
#                  :nickserv-password, irc-password))

#   (defun begin-irc ()
#     (interactive)
#     (elscreen-create)
#     (elscreen-screen-nickname "IRC")
#     (enable-circe-color-nicks)
#     (circe "Rizon")
#     (circe "Freenode"))

#   (require 'lui)
#   (setq lui-highlight-keywords
#         '("Kuma-kun"))

#   ;; Dictionary for Circe
#   ;; (setq lui-flyspell-p t
#   ;;       lui-flyspell-alist '((".*" "american")))

#   (require 'lui-logging)
#   (add-hook 'circe-channel-mode-hook 'enable-lui-logging)
#   (add-hook 'circe-channel-mode-hook 'enable-lui-irc-colors)
# #+END_SRC

* Evil Mode
#+BEGIN_SRC emacs-lisp
  ;; TODO: Figure out why below doesn't work.
  ;; (defvar evil-p nil)

  ;; (defun my-evil-init ()
  ;;   (interactive)
  ;;   (progn
  ;;     (if evil-p
  ;;         (progn
  ;;           (message "Evil Mode Enabled")
  ;;           (setq evil-p t))
  ;;       (progn
  ;;         (message "Evil Mode Disabled")
  ;;         (setq evil-p nil)))
  ;;     (evil-mode)))

  (use-package evil-leader
    :config (evil-leader/set-leader ",")
    )

  (use-package evil
    :ensure evil-leader
    :defer t
    :init (setq evil-toggle-key "C-`")
    (global-evil-leader-mode 1)
    :config (evil-mode 1))


  (use-package evil-matchit
    :ensure evil
    :config (global-evil-matchit-mode 1))


  (use-package evil-surround
    :ensure evil
    :config (global-evil-surround-mode 1))


  (use-package evil-smartparens
    :ensure evil
    :config (add-hook 'smartparens-enabled-hook #'evil-smartparens-mode))


  (use-package evil-nerd-commenter
    :config (evilnc-default-hotkeys))
#+END_SRC

* Org Mode
#+BEGIN_SRC emacs-lisp
  (use-package org
    :ensure t
    :init
    (setq org-directory "~/Dropbox/org")
    (setq org-default-notes-file (concat org-directory "/notes.org"))
    (setq org-agenda-files  '("~/Dropbox/org"))

    (setq org-todo-keywords
          '((sequence "TODO" "|" "DONE")
            (sequence "|" "CANCELED")))

    (add-to-list 'auto-mode-alist '("\\.\\(org\\|org_archive\\|txt\\)$" . org-mode))

    (setq org-pretty-entities 't)
    (setq org-pretty-entities-include-sub-superscripts nil)
    (setq org-agenda-span 'week)
    (setq org-agenda-start-on-weekday nil)
    (setq org-agenda-start-day "-2d")
    :config
    (run-at-time "12:55" 3600 'org-save-all-org-buffers)
    (define-key org-mode-map (kbd "C-x -") #'org-cycle-list-bullet))
#+END_SRC
** CDLaTeX + Org
#+BEGIN_SRC emacs-lisp
  (use-package cdlatex
      :ensure t
      :init (add-hook 'org-mode-hook 'turn-on-org-cdlatex))

#+END_SRC
** Custom Keybindings
#+BEGIN_SRC emacs-lisp
  (global-set-key (kbd "<f12>") 'org-agenda)
  (global-set-key "\C-cb" 'org-iswitchb)
  (define-key global-map (kbd "<f6>") 'org-capture)
#+END_SRC
** Mobile
#+BEGIN_SRC emacs-lisp
  ;; Enable MobileOrg
  (setq org-mobile-inbox-for-pull "~/Dropbox/org/flagged.org")
  (setq org-mobile-directory "~/Dropbox/Apps/MobileOrg")


#+END_SRC
** Capture
#+BEGIN_SRC emacs-lisp
  (defun cap-temp (key name id)
    "A simple function to create new capture templates."
    (list key name 'entry (list 'file+headline "~/Dropbox/org/todo.org" id)
          "* TODO %?\n"))

  (defun add-capture-template (capture-template)
    "Simple function to facilitate adding capture-templates"
    (add-to-list 'org-capture-templates capture-template))

  (setq org-capture-templates
        (list (cap-temp "u" "Unsorted" "Unsorted")
              (cap-temp "t" "TA" "CS 2050")))

  ;;; Projects
  (add-capture-template (cap-temp "e" "Evolution" "EvolutionSim"))
  (add-capture-template (cap-temp "b" "BakaParser" "BakaParser"))

  ;;; Classes
  (add-capture-template (cap-temp "a" "Artificial Intelligence" "CS 3600"))
  (add-capture-template (cap-temp "m" "Machine Learning" "CS 4640"))
  (add-capture-template (cap-temp "p" "Probability Statistics" "MATH 3215"))
  (add-capture-template (cap-temp "c" "Advanced Combinatorics" "CS 3012"))
  (add-capture-template (cap-temp "s" "Systems and Networks" "CS 2200"))



#+END_SRC
** Org-latex
#+BEGIN_SRC emacs-lisp
  (use-package ox-latex
    :ensure nil
    :init
    (unless (boundp 'org-latex-classes)
      (setq org-latex-classes nil))
    :config
    (setq 'org-export-with-toc nil)
    (add-to-list 'org-latex-packages-alist
                 '("margin=0.5in" "geometry"))
    (add-to-list 'org-latex-classes
                 '("article"
                   "\\documentclass{article}"
                   ("\\section{%s}" . "\\section*{%s}"))))
#+END_SRC
* Small Stuff
** Key Chord
# #+BEGIN_SRC emacs-lisp
#   (require 'key-chord)
#   (setq key-chord-two-keys-delay 0.05)
#   (setq key-chord-one-key-delay 0.2)

#   (key-chord-define-global "JJ" 'ace-jump-word-mode)
#   (key-chord-define-global "CC" 'ace-jump-char-mode)
#   (key-chord-define-global "GG" 'ace-jump-line-mode)
#   ;; (key-chord-define-global "JJ" 'switch-to-prev-buffer)
#   (key-chord-mode 1)
# #+END_SRC
** Savehist
    Saves minibuffer and kill/search/regexp rings
#+BEGIN_SRC emacs-lisp
  ;; savehist mode
  (savehist-mode 1)
  (setq savehist-additional-variables '(kill-ring search-ring regexp-search-ring))
#+END_SRC
** Ace Jump Mode
    Allows for quick navigation throughout my files
# #+BEGIN_SRC emacs-lisp
#   (use-package ace-jump-mode
#       :ensure t
#       :bind ("C-c SPC" . ace-jump-mode))
    Using avy instead
** Avy Mode
   Better ace-jump-mode
#+BEGIN_SRC emacs-lisp
  (use-package avy
    :ensure t
    :bind (("C-:" . avy-goto-char-2)
           ("M-:" . avy-goto-word-or-subword-1)))
#+END_SRC

#+END_SRC
** Ace Window Mode
    Allows for quick navigation b/w windows
#+BEGIN_SRC emacs-lisp
  (use-package ace-window
      :ensure t
      :bind (("C-x o" . other-window)
             ("C-x p" . ace-window))
      :init
      (setq aw-keys '(?a ?s ?d ?f ?g ?h ?j ?k ?l)))

#+END_SRC
** Auto-indentation
#+BEGIN_SRC emacs-lisp
  (use-package clean-aindent-mode
      :ensure t
      :init
      (add-hook 'prog-mode-hook 'clean-aindent-mode))


#+END_SRC
** Rainbow mode
#     Color hex values are colored in.
# #+BEGIN_SRC emacs-lisp
#   ;; Rainbow Mode
#   (require 'rainbow-mode)
#   (rainbow-mode 1)
# #+END_SRC
** Rainbow Delimiters
    Makes matching parens/braces/etc. have matching rainbow colors
#+BEGIN_SRC emacs-lisp
  (use-package rainbow-delimiters
      :ensure t
      :init
      (add-hook 'prog-mode-hook 'rainbow-delimiters-mode))

#+END_SRC

** Guide Key
    Shows completion suggestions for keybindings
#+BEGIN_SRC emacs-lisp
  (use-package guide-key
      :ensure t
      :init
      (setq guide-key/guide-key-sequence '("C-x r" "C-x 4" "C-x v" "C-x 8" "C-c" "C-x c" "C-c p" "C-h"))
      (setq guide-key/recursive-key-sequence-flag t)
      (setq guide-key/popup-window-position 'bottom)
      :config
      (guide-key-mode 1))
#+END_SRC

