settings.el

;; TODO: Figure out why below doesn't work.
;; (defvar evil-p nil)

;; (defun my-evil-init ()
;;   (interactive)
;;   (progn
;;     (if evil-p
;;         (progn
;;           (message "Evil Mode Enabled")
;;           (setq evil-p t))
;;       (progn
;;         (message "Evil Mode Disabled")
;;         (setq evil-p nil)))
;;     (evil-mode)))

(use-package evil-leader
  :config (evil-leader/set-leader ",")
  )

(use-package evil
  :ensure evil-leader
  :defer t
  :init (setq evil-toggle-key "C-`")
  (global-evil-leader-mode 1)
  :config (evil-mode 1))


(use-package evil-matchit
  :ensure evil
  :config (global-evil-matchit-mode 1))


(use-package evil-surround
  :ensure evil
  :config (global-evil-surround-mode 1))


(use-package evil-smartparens
  :ensure evil
  :config (add-hook 'smartparens-enabled-hook #'evil-smartparens-mode))


(use-package evil-nerd-commenter
  :config (evilnc-default-hotkeys))

(use-package org
  :ensure t
  :init
  (setq org-directory "~/Dropbox/org")
  (setq org-default-notes-file (concat org-directory "/notes.org"))
  (setq org-agenda-files  '("~/Dropbox/org"))

  (setq org-todo-keywords
        '((sequence "TODO" "|" "DONE")
          (sequence "|" "CANCELED")))

  (add-to-list 'auto-mode-alist '("\\.\\(org\\|org_archive\\|txt\\)$" . org-mode))

  (setq org-pretty-entities 't)
  (setq org-pretty-entities-include-sub-superscripts nil)
  (setq org-agenda-span 'week)
  (setq org-agenda-start-on-weekday nil)
  (setq org-agenda-start-day "-2d")
  :config
  (run-at-time "12:55" 3600 'org-save-all-org-buffers)
  (define-key org-mode-map (kbd "C-x -") #'org-cycle-list-bullet))

(use-package cdlatex
    :ensure t
    :init (add-hook 'org-mode-hook 'turn-on-org-cdlatex))

(global-set-key (kbd "<f12>") 'org-agenda)
(global-set-key "\C-cb" 'org-iswitchb)
(define-key global-map (kbd "<f6>") 'org-capture)

;; Enable MobileOrg
(setq org-mobile-inbox-for-pull "~/Dropbox/org/flagged.org")
(setq org-mobile-directory "~/Dropbox/Apps/MobileOrg")

(defun cap-temp (key name id)
  "A simple function to create new capture templates."
  (list key name 'entry (list 'file+headline "~/Dropbox/org/todo.org" id)
        "* TODO %?\n"))

(defun add-capture-template (capture-template)
  "Simple function to facilitate adding capture-templates"
  (add-to-list 'org-capture-templates capture-template))

(setq org-capture-templates
      (list (cap-temp "u" "Unsorted" "Unsorted")
            (cap-temp "t" "TA" "CS 2050")))

;;; Projects
(add-capture-template (cap-temp "e" "Evolution" "EvolutionSim"))
(add-capture-template (cap-temp "b" "BakaParser" "BakaParser"))

;;; Classes
(add-capture-template (cap-temp "a" "Artificial Intelligence" "CS 3600"))
(add-capture-template (cap-temp "m" "Machine Learning" "CS 4640"))
(add-capture-template (cap-temp "p" "Probability Statistics" "MATH 3215"))
(add-capture-template (cap-temp "c" "Advanced Combinatorics" "CS 3012"))
(add-capture-template (cap-temp "s" "Systems and Networks" "CS 2200"))

(use-package ox-latex
  :ensure nil
  :init
  (unless (boundp 'org-latex-classes)
    (setq org-latex-classes nil))
  :config
  (setq 'org-export-with-toc nil)
  (add-to-list 'org-latex-packages-alist
               '("margin=0.5in" "geometry"))
  (add-to-list 'org-latex-classes
               '("article"
                 "\\documentclass{article}"
                 ("\\section{%s}" . "\\section*{%s}"))))

;; savehist mode
(savehist-mode 1)
(setq savehist-additional-variables '(kill-ring search-ring regexp-search-ring))

(use-package avy
  :ensure t
  :bind (("C-:" . avy-goto-char-2)
         ("M-:" . avy-goto-word-or-subword-1)))

(use-package ace-window
    :ensure t
    :bind (("C-x o" . other-window)
           ("C-x p" . ace-window))
    :init
    (setq aw-keys '(?a ?s ?d ?f ?g ?h ?j ?k ?l)))

(use-package clean-aindent-mode
    :ensure t
    :init
    (add-hook 'prog-mode-hook 'clean-aindent-mode))

(use-package rainbow-delimiters
    :ensure t
    :init
    (add-hook 'prog-mode-hook 'rainbow-delimiters-mode))

(use-package guide-key
    :ensure t
    :init
    (setq guide-key/guide-key-sequence '("C-x r" "C-x 4" "C-x v" "C-x 8" "C-c" "C-x c" "C-c p" "C-h"))
    (setq guide-key/recursive-key-sequence-flag t)
    (setq guide-key/popup-window-position 'bottom)
    :config
    (guide-key-mode 1))
