settings.org
** Multiple Cursors
#+BEGIN_SRC emacs-lisp
  (use-package multiple-cursors
      :ensure t
      :bind (("C-S-c C-S-c" . mc/edit-lines)
             ("C-S-c C-e" . mc/edit-ends-of-lines)
             ("C-S-c C-a" . mc/edit.beginnings-of-lines)
             ("C->" . mc/mark-next-like-this)
             ("C-<" . mc/mark-previous-like-this)))
#+END_SRC

** Visual Regexp
    Search&Replace + Mulitple cursors by regexp
    Set up to use python regexp instead of default elisp regexp
#+BEGIN_SRC emacs-lisp
  (use-package visual-regexp
    :ensure visual-regexp-steroids
    :bind (("C-c C-s" . vr/query-replace)
           ("C-c s" . vr/replace)
           ("C-c m" . vr/mc-mark)
           ("C-r" . vr/isearch-backward)
           ("C-s" . vr/isearch-forward)))

#+END_SRC

** Anzu
    Shows # of completion candidates on mode line
#+BEGIN_SRC emacs-lisp
  (use-package anzu
      :ensure t
      :config
      (global-anzu-mode 1))
#+END_SRC
** Undo Tree
    Visual display for complex undo/redo functions
#+BEGIN_SRC emacs-lisp
  (use-package undo-tree
      :ensure t
      :config
  (global-undo-tree-mode 1))
#+END_SRC
** Volatile-Highlights
    Highlights most recent change in cut (kill-yank operations mostly)
#+BEGIN_SRC emacs-lisp
  (use-package volatile-highlights
      :ensure t
      :config (volatile-highlights-mode t))






#+END_SRC

** Chrome - Edit with Emacs
# #+BEGIN_SRC emacs-lisp
#   (require 'edit-server)
#   (edit-server-start)
# #+END_SRC


* Unorganized
#+BEGIN_SRC emacs-lisp
  (message "Emacs is ready to go!")
#+END_SRC
