settings.el

(use-package multiple-cursors
    :ensure t
    :bind (("C-S-c C-S-c" . mc/edit-lines)
           ("C-S-c C-e" . mc/edit-ends-of-lines)
           ("C-S-c C-a" . mc/edit.beginnings-of-lines)
           ("C->" . mc/mark-next-like-this)
           ("C-<" . mc/mark-previous-like-this)))

(use-package visual-regexp
  :ensure visual-regexp-steroids
  :bind (("C-c C-s" . vr/query-replace)
         ("C-c s" . vr/replace)
         ("C-c m" . vr/mc-mark)
         ("C-r" . vr/isearch-backward)
         ("C-s" . vr/isearch-forward)))

(use-package anzu
    :ensure t
    :config
    (global-anzu-mode 1))

(use-package undo-tree
    :ensure t
    :config
(global-undo-tree-mode 1))

(use-package volatile-highlights
    :ensure t
    :config (volatile-highlights-mode t))

(message "Emacs is ready to go!")
